backend/views/address/index.php

SELECT * FROM `user` WHERE `id`=1
SELECT * FROM `region` WHERE `id`=1
---
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            'id',
            [
                'attribute' => 'user_id',
                'value' => function ($model) {
                    return $model->user ? $model->user->username : '-';
                },
            ],
            'name',
            'consignee',
            //'country',
            //'province',
            //'city',
            //'district',
            [
                'attribute' => 'region',
                'value' => function ($model) {
                    return (isset($model->country0) ? $model->country0->name : '-') . (isset($model->province0) ? $model->province0->name : '-') . (isset($model->city0) ? $model->city0->name : '-') . (isset($model->district0) ? $model->district0->name : '-');
                },
                /*'filter' => Html::activeDropDownList(
                    $searchModel,
                    'province',
                    ArrayHelper::map(\common\models\Region::find()->all(), 'id', 'name'),
                    ['class' => 'form-control', 'prompt' => Yii::t('app', 'Please Filter')]
                )*/
            ],