backend/controllers/AddressController.php

    public function actionCreate()
    {
        $model = new Address();
        $model->loadDefaultValues();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `address` (`user_id`, `consignee`, `country`, `province`, `city`, `district`, `default`, `name`, `address`, `zipcode`, `phone`, `mobile`, `email`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES (12, '王臣', 1, 320000, 321100, 321181, 1, '王臣', '收到', '', '', '12345', '', 1511514747, 1511514747, 1, 1)

    protected function findModel($id)
    {
        if (($model = Address::findOne($id)) !== null) {
---
SELECT * FROM `address` WHERE `id`='9'