backend/controllers/ProductController.php

INSERT INTO `product` (`stock`, `weight`, `market_price`, `price`, `type`, `brand_id`, `star`, `sales`, `status`, `category_id`, `name`, `sku`, `brief`, `content`, `keywords`, `description`, `created_at`, `updated_at`, `created_by`, `updated_by`) VALUES (23, '2', '89', '89', 2, 1, '5.00', 0, 1, 1, 'iphone9', 'iphone9', 'iphone9', '<p>iphone9</p>\r\n', '', 'iphone9', 1511942979, 1511942979, 1, 1)
---
    public function actionCreate()
    {
        $model = new Product();
        $model->loadDefaultValues();
        //var_dump($model->type);exit;
        if ($model->load(Yii::$app->request->post())) {
            $model->type = ProductType::arrayToInt($model->type);
            if ($model->save()) {

UPDATE `product` SET `category_id`=1, `stock`=23, `type`=10, `brand_id`=1, `status`=1, `updated_at`=1511944908 WHERE `id`=14
SELECT * FROM `product_image` WHERE `product_id`='14' ORDER BY `sort_order`
---
    public function actionUpdate($id)
    {
        $model = $this->findModel($id);

        if ($model->load(Yii::$app->request->post())) {
            //var_dump($model->type);exit;
            $model->type = ProductType::arrayToInt($model->type);
            if ($model->save()) {
                if (isset(Yii::$app->request->post()['imageSort'])) {
                    foreach (Yii::$app->request->post()['imageSort'] as $key => $sortOrder) {
                        ProductImage::updateAll(['sort_order' => $sortOrder], ['id' => $key]);
                    }
                }

                $productImage = ProductImage::find()->where(['product_id' => $id])->orderBy(['sort_order' => SORT_ASC])->one();