backend/controllers/RegionController.php

    public function actionAjaxListChild($id)
    {
        $countChild = Region::find()->where(['parent_id' => $id])->count();
        $children = Region::find()->where(['parent_id' => $id])->all();
---
SELECT COUNT(*) FROM `region` WHERE `parent_id`='320800'
SELECT * FROM `region` WHERE `parent_id`='320800'