backend/models/User.php

SELECT * FROM `auth_role`
---
    public static function getArrayAuthRole()
    {
        return ArrayHelper::map(AuthRole::find()->all(), 'id', 'name');