backend/views/product/_form.php

        ],
    ]); ?>

    <?= $form->field($model, 'category_id')->dropDownList(ArrayHelper::map(Category::get(0, Category::find()->asArray()->all()), 'id', 'label')) ?>
---
SELECT * FROM `category`


    <?= $form->field($model, 'type')->checkboxList(\common\models\ProductType::labels()) ?>

    <?= $form->field($model, 'brand_id')->dropDownList(ArrayHelper::map(\common\models\Brand::find()->all(), 'id', 'name'), ['prompt' => Yii::t('app', 'Please Select')]) ?>
---
SELECT * FROM `brand`